In [1]:
import pandas as pd
import numpy as np

In [2]:
#Dataset
data = {
    'student':['Amit', 'John', 'Jacob', "David", "Steve"],
    'rank':[1, 4, 3, 5, 2],
    'marks':[95, 70, 80, 60, 90]
}

df = pd.DataFrame(data)
print('student records\n\n', df)

student records

   student  rank  marks
0    Amit     1     95
1    John     4     70
2   Jacob     3     80
3   David     5     60
4   Steve     2     90

In [3]:
df = pd.DataFrame(data)
df

  student  rank  marks
0    Amit     1     95
1    John     4     70
2   Jacob     3     80
3   David     5     60
4   Steve     2     90

---

In [10]:
#indexing a dataframe
df2 = pd.DataFrame(data, index=range(1, (len(df)+1)))
df2

  student  rank  marks
1    Amit     1     95
2    John     4     70
3   Jacob     3     80
4   David     5     60
5   Steve     2     90

In [5]:
#accesing a value in a dataframe
print('student records:\n\n', df2)
print('\nValue:', df2.loc[3, 'student'])

student records:

   student  rank  marks
1    Amit     1     95
2    John     4     70
3   Jacob     3     80
4   David     5     60
5   Steve     2     90

Value: Jacob

---

In [6]:
#using iloc attribute - by integer location
df2.iloc[[4,1,0],[1,0]]

   rank student
5     2   Steve
2     4    John
1     1    Amit

---

In [7]:
df2.index

RangeIndex(start=1, stop=6, step=1)

In [8]:
for row_elem in df2['student']:
    for row_elem2 in df2['rank']:
        if (row_elem == 'Amit'or row_elem == 'Steve') and row_elem2 <=3:   
            print(row_elem, row_elem2)

Amit 1
Amit 3
Amit 2
Steve 1
Steve 3
Steve 2

---

In [9]:
#Joining dataframes ~ similar to merge

data1 = {
    'Id': ['S101', 'S102', 'S103', 'S104', 'S105'],
    'Student':['Amit', 'John', 'Jacob', "David", "Steve"],
    'Roll': [101,102,103,104,105]
}

data2 = {
    'Rank': [1,4,3,5,2],
    'Marks': [85,90,78,88,92]
}

df3 = pd.DataFrame(data1)
df4 = pd.DataFrame(data2)

combined_df = df3.join(df4)
combined_df.index = range(1, len(combined_df) + 1)
combined_df

     Id Student  Roll  Rank  Marks
1  S101    Amit   101     1     85
2  S102    John   102     4     90
3  S103   Jacob   103     3     78
4  S104   David   104     5     88
5  S105   Steve   105     2     92

In [10]:
#concatenating dataframes ~ similar to append

data3 = {
    'Id': ['S106', 'S107', 'S108'],
    'Student':['Alice', 'Bob', 'Charlie'],
    'Roll': [106,107,108],
    'Rank': [1,4,3],
    'Marks': [85,90,78]
}

df5 = pd.DataFrame(data3)

concatenated_df = pd.concat([df3, df5], ignore_index=True, sort=True)
concatenated_df.index = range(1, len(concatenated_df) + 1)
concatenated_df

     Id  Marks  Rank  Roll  Student
1  S101    NaN   NaN   101     Amit
2  S102    NaN   NaN   102     John
3  S103    NaN   NaN   103    Jacob
4  S104    NaN   NaN   104    David
5  S105    NaN   NaN   105    Steve
6  S106   85.0   1.0   106    Alice
7  S107   90.0   4.0   107      Bob
8  S108   78.0   3.0   108  Charlie

In [11]:
dummydf = concatenated_df.dropna()
dummydf

     Id  Marks  Rank  Roll  Student
6  S106   85.0   1.0   106    Alice
7  S107   90.0   4.0   107      Bob
8  S108   78.0   3.0   108  Charlie

In [12]:
concatenated_df.shape

(8, 5)

---

In [41]:
#creating pandas series ~ 1-dim array
data2 = [10,20,10,40,80,100, np.nan]
s = pd.Series(data2, index=range(1, len(data2)+1), name='Numbers')
print(s)

1     10.0
2     20.0
3     10.0
4     40.0
5     80.0
6    100.0
7      NaN
Name: Numbers, dtype: float64

In [42]:
#accessing a value from a panda series
s[3] = 10
s.hasnans

True